In [1]:
import pandas as pd

In [2]:
pd.read_csv('https://raw.githubusercontent.com/RakeshKrishna143/Pandas-Tutorial/master/Apple%20Dataset.csv')

            Date    Open      High     Low   Close    Volume
0       1/4/2010  213.43  214.5000  212.38  214.01  17633200
1       1/5/2010  214.60  215.5900  213.25  214.38  21496600
2       1/6/2010  214.38  215.2300  210.75  210.97  19720000
3       1/7/2010  211.75  212.0000  209.05  210.58  17040400
4       1/8/2010  210.30  212.0000  209.06  211.98  15986100
...          ...     ...       ...     ...     ...       ...
1757  12/23/2016  115.59  116.5200  115.59  116.52  14249484
1758  12/27/2016  116.52  117.8000  116.49  117.26  18296855
1759  12/28/2016  117.52  118.0166  116.20  116.76  20905892
1760  12/29/2016  116.45  117.1095  116.40  116.73  15039519
1761  12/30/2016  116.65  117.2000  115.43  115.82  30586265

[1762 rows x 6 columns]

In [3]:
a = pd.read_csv('https://raw.githubusercontent.com/RakeshKrishna143/Pandas-Tutorial/master/Apple%20Dataset.csv')

In [4]:
a.shape

(1762, 6)

In [5]:
a.dtypes

Date       object
Open      float64
High      float64
Low       float64
Close     float64
Volume      int64
dtype: object

In [6]:
a.describe()

              Open         High          Low        Close        Volume
count  1762.000000  1762.000000  1762.000000  1762.000000  1.762000e+03
mean    313.074500   315.910814   309.824105   312.926818  2.819498e+07
std     185.301563   186.898629   183.374468   185.147360  2.006877e+07
min      90.000000    90.700000    89.470000    90.280000  5.624800e+06
25%     115.222500   116.362500   114.002500   115.190000  1.379790e+07
50%     318.230000   320.600000   316.545000   318.240000  2.177095e+07
75%     470.880000   478.110000   467.973500   472.592500  3.700019e+07
max     702.410000   705.070000   699.570000   702.100000  1.895606e+08

In [7]:
a.describe(percentiles=[.1,.5,.7]) #use percentiles to obtain the required percentage You need by feeding the values to the list

              Open         High          Low        Close        Volume
count  1762.000000  1762.000000  1762.000000  1762.000000  1.762000e+03
mean    313.074500   315.910814   309.824105   312.926818  2.819498e+07
std     185.301563   186.898629   183.374468   185.147360  2.006877e+07
min      90.000000    90.700000    89.470000    90.280000  5.624800e+06
10%     100.581000   101.592990    99.878000   100.862900  1.010140e+07
50%     318.230000   320.600000   316.545000   318.240000  2.177095e+07
70%     437.979000   443.560600   433.155000   438.773000  3.348607e+07
max     702.410000   705.070000   699.570000   702.100000  1.895606e+08

In [8]:
pd.read_csv('https://raw.githubusercontent.com/RakeshKrishna143/Pandas-Tutorial/master/Mark%20Dataset.csv')

,gender,NationalITy,PlaceofBirth,StageID,GradeID,SectionID,Topic,Semester,Relation,raisedhands,VisITedResources,AnnouncementsView,Discussion,ParentAnsweringSurvey,ParentschoolSatisfaction,StudentAbsenceDays,Class
0,M,KW,KuwaIT,lowerlevel,G-04,A,IT,F,Father,15,16,2,20,Yes,Good,Under-7,M
1,M,KW,KuwaIT,lowerlevel,G-04,A,IT,F,Father,20,20,3,25,Yes,Good,Under-7,M
2,M,KW,KuwaIT,lowerlevel,G-04,A,IT,F,Father,10,7,0,30,No,Bad,Above-7,L
3,M,KW,KuwaIT,lowerlevel,G-04,A,IT,F,Father,30,25,5,35,No,Bad,Above-7,L
4,M,KW,KuwaIT,lowerlevel,G-04,A,IT,F,Father,40,50,12,50,No,Bad,Above-7,M
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
475,F,Jordan,Jordan,MiddleSchool,G-08,A,Chemistry,S,Father,5,4,5,8,No,Bad,Above-7,L
476,F,Jordan,Jordan,MiddleSchool,G-08,A,Geology,F,Father,50,77,14,28,No,Bad,Under-7,M
477,F,Jordan,Jordan,MiddleSchool,G-08,A,Geology,S,Father,55,74,25,29,No,Bad,Under-7,M
478,F,Jordan,Jordan,MiddleSchool,G-08,A,History,F,Father,30,17,14,57,No,Bad,Above-7,L
479,F,Jordan,Jordan,MiddleSchool,G-08,A,History,S,Father,35,14,23,62,No,Bad,Above-7,L

In [9]:
m = pd.read_csv('https://raw.githubusercontent.com/RakeshKrishna143/Pandas-Tutorial/master/Mark%20Dataset.csv')

In [10]:
m.describe()

       raisedhands  VisITedResources  AnnouncementsView  Discussion
count   480.000000        480.000000         480.000000  480.000000
mean     46.775000         54.797917          37.918750   43.283333
std      30.779223         33.080007          26.611244   27.637735
min       0.000000          0.000000           0.000000    1.000000
25%      15.750000         20.000000          14.000000   20.000000
50%      50.000000         65.000000          33.000000   39.000000
75%      75.000000         84.000000          58.000000   70.000000
max     100.000000         99.000000          98.000000   99.000000

In [11]:
m.dtypes

gender                      object
NationalITy                 object
PlaceofBirth                object
StageID                     object
GradeID                     object
SectionID                   object
Topic                       object
Semester                    object
Relation                    object
raisedhands                  int64
VisITedResources             int64
AnnouncementsView            int64
Discussion                   int64
ParentAnsweringSurvey       object
ParentschoolSatisfaction    object
StudentAbsenceDays          object
Class                       object
dtype: object

In [12]:
m.describe(include=['object'])  #If you want to work with String (object) typed columns Use includes

,gender,NationalITy,PlaceofBirth,StageID,GradeID,SectionID,Topic,Semester,Relation,ParentAnsweringSurvey,ParentschoolSatisfaction,StudentAbsenceDays,Class
count,480,480,480,480,480,480,480,480,480,480,480,480,480
unique,2,14,14,3,10,3,12,2,2,2,2,2,3
top,M,KW,KuwaIT,MiddleSchool,G-02,A,IT,F,Father,Yes,Good,Under-7,M
freq,305,179,180,248,147,283,95,245,283,270,292,289,211

In [13]:
# count specifies the number of string present in each column
#unique specifies the number of string present without any duplicate values
# top specifies the string with more number of occurrences
# freq specifies the number of occurrence of the top string present in the column

In [ ]:
#The github link for this notebok is in the description